tap 'caskroom/cask'
tap 'github/bootstrap'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/test-bot'

# Add top casks first
cask 'java'
cask 'docker'
cask 'google-chrome'
cask 'iterm2'
cask 'caffeine'

brew 'ack'
brew 'asciinema'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'boost'
brew 'boot2docker'
brew 'cloog018'
brew 'cmake'
brew 'cmake'
brew 'cscope'
brew 'curl'
brew 'dirmngr'
brew 'dnsmasq'
brew 'docker-compose'
brew 'docker-machine'
brew 'ec2-api-tools'
brew 'findutils'
brew 'gcc48'
brew 'gcc5'
brew 'gdbm'
brew 'gettext'
brew 'git-crypt'
brew 'git'
brew 'gmp'
brew 'gmp4'
brew 'gnu-tar'
brew 'gnupg'
brew 'gnupg2'
brew 'go'
brew 'govendor'
brew 'gpg-agent'
brew 'graphviz'
brew 'grc'
brew 'heroku'
brew 'highlight'
brew 'htop'
brew 'httperf'
brew 'hub'
brew 'iftop'
brew 'ipcalc'
brew 'jq'
brew 'jsonlint'
brew 'keybase'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'libevent'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libksba'
brew 'libmpc'
brew 'libmpc08'
brew 'libpng'
brew 'libssh'
brew 'libtool'
brew 'libusb-compat'
brew 'libusb'
brew 'libyaml'
brew 'lua'
brew 'macvim'
brew 'vim'
brew 'makedepend'
brew 'mas'
brew 'md5sha1sum'
brew 'mercurial'
brew 'mpfr'
brew 'mpfr2'
brew 'msgpack'
brew 'ncdu'
brew 'nginx', restart_service: true
brew 'nmap'
brew 'node'
brew 'oniguruma'
brew 'openssl'
brew 'openssl@1.1'
brew 'ossp-uuid'
brew 'packer'
brew 'pcre'
brew 'pinentry'
brew 'pkg-config'
brew 'postgresql'
brew 'pth'
brew 'python'
brew 'rainbarf'
brew 'rbenv-default-gems'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 's3cmd'
brew 'shellcheck'
brew 'slackcat'
brew 'socat'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'terraform'
brew 'thefuck'
brew 'tmate'
brew 'tmux'
brew 'tree'
brew 'utf8proc'
brew 'vegeta'
brew 'wakeonlan'
brew 'watch'
brew 'wget'
brew 'xz'
brew 'zsh'

cask '1password'
cask 'alfred'
cask 'atom'
cask 'cakebrew'
cask 'charles'
cask 'cyberduck'
cask 'deepvacuum'
cask 'disk-inventory-x'
cask 'docker-toolbox'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'github-desktop'
cask 'google-drive'
cask 'gpgtools'
cask 'xquartz'
cask 'inkscape'
cask 'java'
cask 'joinme'
cask 'kaleidoscope'
cask 'keepingyouawake'
cask 'launchrocket'
cask 'libreoffice'
cask 'logitech-options'
cask 'minikube'
cask 'openoffice'
cask 'private-internet-access'
cask 'psequel'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'steam'
cask 'textual'
cask 'thunderbird'
cask 'tigervnc-viewer'
cask 'torbrowser'
cask 'transmission'
cask 'transmit'
cask 'tunnelblick'
cask 'unetbootin'
cask 'vagrant-manager'
cask 'vagrant'
cask 'vlc'
cask 'vmware-fusion'
cask 'yujitach-menumeters'
cask 'zoomus'

mas 'Deliveries', id: 924726344
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Microsoft Remote Desktop', id: 715768417
mas 'Monosnap', id: 540348655
mas 'Notability', id: 736189492
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'SourceTree', id: 411678673
mas 'The Unarchiver', id: 425424353
mas 'Tweetbot', id: 557168941
mas 'Wallcat', id: 1000397973
mas 'Xcode', id: 497799835
